{
  "url": "https://www.ycombinator.com/companies/landeed/jobs/1RGlF1W-founding-fullstack-engineer-react-react-native-any-backend-india",
  "source": "y_combinator",
  "scraped_at": "2025-10-03 22:10:49",
  "title": "Founding Fullstack Engineer: React / React Native + Any Backend (India)",
  "company": "Landeed",
  "location": "•",
  "description_html": "<div class=\"prose max-w-full\"><h3>Responsibility</h3>\n<p>As a Founding Software Engineer, you will have an organization-level impact on the product. You be a hands-on expert that takes on the most challenging technical implementations, mentors the team, and ensures that features are delivered on time and to specification.</p>\n<h3>Our stack</h3>\n<p>React \bNative + NextJS + FastAPI + OpenAPI</p>\n<h3>What drives success for this role:</h3>\n<ul>\n<li>Experience: At least five (5) years of experience developing software in an agile team environment.</li>\n<li>Full Stack: Expertise with React Native /ReactJS/ NextJS and significant experience working with any backend technology e.g. Golang, NodeJS or any Rust framework. You should have experience across the tech stack, specifically Typescript, React, and React Native. Experience with gRPC, Native iOS and Android is highly desirable.</li>\n<li>Delivery: Strong project management skills and a proven track record of taking these types of projects through all stages from inception to deployment.</li>\n<li>Testing/Quality: Ability to understand and debug native code as well as performance tune mobile applications.</li>\n<li>Communication: Strong technical and non-technical communication skills with the ability to articulate a vision to audiences of varying technical expertise and collaborate with stakeholders at all levels of the organization.</li>\n<li>Leadership: Track record of ownership for team-scale execution and technical excellence.</li>\n</ul>\n<h3>Location</h3>\n<p>Hitec City, Hyderabad</p>\n</div>",
  "description_text": "Responsibility As a Founding Software Engineer, you will have an organization-level impact on the product. You be a hands-on expert that takes on the most challenging technical implementations, mentors the team, and ensures that features are delivered on time and to specification. Our stack React \bNative + NextJS + FastAPI + OpenAPI What drives success for this role: Experience: At least five (5) years of experience developing software in an agile team environment. Full Stack: Expertise with React Native /ReactJS/ NextJS and significant experience working with any backend technology e.g. Golang, NodeJS or any Rust framework. You should have experience across the tech stack, specifically Typescript, React, and React Native. Experience with gRPC, Native iOS and Android is highly desirable. Delivery: Strong project management skills and a proven track record of taking these types of projects through all stages from inception to deployment. Testing/Quality: Ability to understand and debug native code as well as performance tune mobile applications. Communication: Strong technical and non-technical communication skills with the ability to articulate a vision to audiences of varying technical expertise and collaborate with stakeholders at all levels of the organization. Leadership: Track record of ownership for team-scale execution and technical excellence. Location Hitec City, Hyderabad",
  "job_type": "Full-time",
  "experience_level": "Senior Software Engineer"
}