{
  "url": "https://www.ycombinator.com/companies/flock-safety/jobs/YME3UnJ-senior-software-engineer-backend-integrations",
  "source": "y_combinator",
  "scraped_at": "2025-10-03 22:09:13",
  "title": "Senior Software Engineer, Backend Integrations",
  "company": "Flock Safety",
  "location": "Atlanta, GA, US / Remote (Atlanta, GA, US)",
  "description_html": "<div class=\"prose max-w-full\"><h2><strong>Who is Flock?</strong></h2>\n<p>Flock Safety is an all-in-one technology solution to eliminate crime and keep communities safe. Our intelligent platform combines the power of communities at scale - including cities, businesses, schools, and law enforcement agencies - to shape a safer future together. Our full-service, maintenance-free technology solution is trusted by communities across the country to help solve and deter crime in the pursuit of safer communities for everyone.</p>\n<p>Our holistic public safety platform is comprehensive and intelligent, providing the actionable evidence needed to solve, deter and reduce crime across neighborhoods, schools, businesses and entire cities. Without compromising transparency or privacy, we are turning unbiased data into objective answers.</p>\n<p>Flock strives to offer a career-defining experience where you can also make an impact on your community. While safety is a serious business, we are a supportive team that is optimizing the remote experience to create strong and fulfilling relationships even when we are physically apart. Our group of hard-working employees thrive in a positive and inclusive environment, where a bias towards action is rewarded.</p>\n<p>We have raised over $500M in venture capital from investors including Tiger Global, Andreessen Horowitz, Matrix Partners, Meritech Capital Partners, and Initialized Capital. Now surpassing a $5.5B valuation, Flock is scaling intentionally and seeking the best and brightest to help us meet our goal of reducing crime in the United States by 25% in the next three years.</p>\n<h1><strong>The Opportunity</strong></h1>\n<p>The integrations team is seeking a seasoned Senior Software Engineer, to bolster our rapid expansion to new business verticals. Our customer-facing software continues to solve crime for new customer personas, resulting in new partnerships and integrations. To keep momentum, we must integrate with various data sources that provide real-time crime and operational context on multiple FlockOS surfaces.</p>\n<p>You'll be working on integrating a variety of real-time law enforcement systems, specifically  computer-assisted-dispatch (CAD). You will also provide feedback to our <a href=\"https://docs.flocksafety.com/\" target=\"_blank\">developer hub</a> with a growing list of APIs for developers.</p>\n<p>A key part of this role will be to partner and communicate daily with customers, 3rd party vendors, and all stakeholders to ensure custom integrations are scoped, built, delivered, and supported successfully.</p>\n<h1><strong>The Skillset</strong></h1>\n<ul>\n<li>Love writing code and have extensive experience doing so</li>\n<li>Excellent written and verbal communication skills in customer-facing communications</li>\n<li>Able to organize, keep track, and deliver multiples projects in parallel</li>\n<li>Motivated by taking an unknown problem, sinking your teeth in, and coming up with a plan of attack.</li>\n<li>Proficiency in writing, optimizing, and troubleshooting complex SQL queries for data extraction, transformation, and integration.</li>\n<li>Proficiency with relational database systems (especially PostgreSQL and Microsoft SQL Server) and a solid understanding of database design principles</li>\n<li>Experience in integrating and syncing data between disparate systems, including resolving data format inconsistencies</li>\n<li>Understanding of on-premise networks, including firewalls, VPNs, and network configurations, to ensure seamless system communication and data transfer.</li>\n<li>Experience with Go and Typescript (Node) web services</li>\n<li>Experience with microservice-oriented architecture and designing systems at scale – We process over 1 billion images daily in real-time.</li>\n<li>Strong backend/database and pub/sub experience, we leverage Postgres DB, OpenSearch, DynamoDB, Redis (use the right tool for the job)</li>\n<li>Experience with AWS and cloud tooling such as Kubernetes (EKS), AWS Lambda, Docker</li>\n<li>Ability to work cross-functionally with internal and external engineering and product teams</li>\n<li>The ideal candidate will have experience with CAD systems and databases</li>\n</ul>\n<p><em>Feeling uneasy that you haven’t ticked every box? That’s okay; we’ve felt that way too. Studies have shown women and minorities are less likely to apply unless they meet all qualifications. We encourage you to break the status quo and apply to roles that would make you excited to come to work every day.</em></p>\n<h1><strong>90 Days at Flock</strong></h1>\n<p>We are a results-oriented culture and believe job descriptions are a thing of the past. We prescribe 90 day plans and believe that good days, lead to good weeks, which lead to good months. This serves as a preview of the 90 day plan you will receive if you were to be hired as a Senior Software Engineer at Flock Safety.</p>\n<p><strong>The First 30 Days</strong></p>\n<ul>\n<li>Meet with your teammates and stakeholders!</li>\n<li>Understand current processes and procedures</li>\n<li>Work on minor tasks for the sprint with support</li>\n<li>Work towards understanding how integrations at Flock work</li>\n<li>Collaborate with additional teams to gain context on how integrations fit into the overall system</li>\n<li>Asking questions in a public way to spread knowledge</li>\n</ul>\n<p><strong>The First 60 Days</strong></p>\n<ul>\n<li>Ability to perform the role with decreased need for guidance</li>\n<li>Ability to complete medium-sized tasks with little support</li>\n<li>Possess a high-level understanding of the features we are working on</li>\n<li>Understand the software design philosophies being used</li>\n<li>Comfortable navigating through the code base</li>\n<li>Engaged during technical conversations to increase the quality of input</li>\n</ul>\n<p><strong>90 Days &amp; Beyond</strong></p>\n<ul>\n<li>Able to explain each of the integration services’ purpose.</li>\n<li>Identify 3-5 ideas of where you see risk (stability, features, process, etc)</li>\n<li>Ability to perform role with little guidance with transparency</li>\n<li>Be comfortable picking up engineering tasks of larger size and more ambiguity</li>\n<li>Communicating across multiple teams to solve problems efficiently</li>\n<li>Contributing ideas for how we build better software</li>\n<li>Contributing valuable feedback in PR reviews</li>\n<li>Participate in software engineering demo day by presenting a topic that you worked on in the last few months</li>\n</ul>\n<h1><strong>The Interview Process</strong></h1>\n<p>We want our interview process to be a true reflection of our culture: transparent and collaborative. Throughout the interview process, your recruiter will guide you through the next steps and ensure you feel prepared every step of the way.</p>\n<ol>\n<li>Our First Chat: During this first conversation, you’ll meet with a recruiter to chat through your background, what you could bring to Flock, what you are looking for in your next role, and who we are.</li>\n<li>The Hiring Manager Interview: You will meet with your potential future boss to really dive into the role, the team, expectations, and what success means at Flock. This is your chance to really nerd out with someone in your field.</li>\n<li>The Technical Assessment: Our technical assessments seek to test the hard skills required to do the job. Engineers may find themselves in coding interviews or architecture discussions, sales roles may present mock discovery calls, and leadership roles may craft 90 day plans. Your recruiter will inform you of which assessment you will be assigned and ensure you are fully prepared for your big day.</li>\n<li>The Panel: Learn more about the team, responsibilities, and workflows. You should be prepared to speak about past projects, how you collaborate and communicate with others, and how you live our values. Depending on the team and role you are interviewing for, you may meet with several teammates as well as cross-functional partners.</li>\n<li>The Executive Review: A chance to meet an executive in your function and view Flock from a different lens. Be prepared to ask well-thought-out questions about the company, culture, and more.</li>\n</ol>\n<p></p>\n<h1><strong>The Perks</strong></h1>\n<p>💰<strong>Salary &amp; Equity</strong>: In this role, you’ll receive a starting salary of $170,000-$190,000 as well as stock options</p>\n<p>🌴<strong>Flexible PTO</strong>: We seriously mean it, plus 11 company holidays.</p>\n<p>⚕️<strong>Fully-paid <a href=\"https://drive.google.com/file/d/1W8o-fLMVCOWL9pYFAVSMsSTaJAA9Vm_J/view\" target=\"_blank\">health benefits</a> plan for employees</strong>: including Medical, Dental, and Vision and an HSA match.</p>\n<p>👪<strong>Family Leave</strong>: All employees receive 12 weeks of 100% paid parental leave. Birthing parents are eligible for an additional 6-8 weeks of physical recovery time.</p>\n<p>🍼<strong>Fertility &amp; Family Benefits:</strong> We have partnered with <a href=\"https://www.mavenclinic.com/\" target=\"_blank\">Maven</a>, a complete digital health benefit for starting and raising a family. In 2025, Flock will provide a $ 50,000-lifetime maximum benefit related to eligible adoption, surrogacy, or fertility expenses.</p>\n<p>💖<strong>Caregiver Support:</strong> We have partnered with <a href=\"https://www.cariloop.com/\" target=\"_blank\">Cariloop</a> to provide our employees with caregiver support</p>\n<p>💸<strong>Carta Tax Advisor:</strong> Employees receive 1:1 sessions with Equity Tax Advisors who can address individual grants, model tax scenarios, and answer general questions.</p>\n<p>💚<strong>ERGs:</strong> We want all employees to thrive and feel like they belong at Flock. We offer three ERGs today - Women of Flock, Flock Proud, and Melanin Motion. If you are interested in talking to a representative from one of these, please let your recruiter know.</p>\n<p><strong>💻WFH Stipend:</strong> $150 per month to cover the costs of working from home.</p>\n<p><strong>📚Productivity Stipend:</strong> $250 per year to use on Audible, Calm, Masterclass, Duolingo, Grammarly and so much more.</p>\n<p><strong>🏠Home Office Stipend:</strong> A one-time $750 to help you create your dream office.</p>\n<p>🐾<strong>Pet Insurance:</strong> We’ve partnered with <a href=\"https://hello.pumpkin.care/comparesem/?utm_source=google&amp;utm_medium=cpc&amp;utm_campaign=Google_USA_Search_Brand&amp;utm_content=Google_USA_Search_Brand_General_Exact&amp;utm_campaignid=15710600630&amp;utm_adgroupid=131181652986&amp;utm_adid=571944109837&amp;utm_keyword=pumpkin%20pet%20insurance&amp;utm_matchtype=e&amp;gclid=Cj0KCQiA1sucBhDgARIsAFoytUuUlyKvQJvyvkLRt5ii432apq_7ng3BLv0vyiWHFdaawRzn-FrsMckaAvI5EALw_wcB\" target=\"_blank\">Pumpkin</a> to provide insurance for our employee’s fur babies.</p>\n</div>",
  "description_text": "Who is Flock? Flock Safety is an all-in-one technology solution to eliminate crime and keep communities safe. Our intelligent platform combines the power of communities at scale - including cities, businesses, schools, and law enforcement agencies - to shape a safer future together. Our full-service, maintenance-free technology solution is trusted by communities across the country to help solve and deter crime in the pursuit of safer communities for everyone. Our holistic public safety platform is comprehensive and intelligent, providing the actionable evidence needed to solve, deter and reduce crime across neighborhoods, schools, businesses and entire cities. Without compromising transparency or privacy, we are turning unbiased data into objective answers. Flock strives to offer a career-defining experience where you can also make an impact on your community. While safety is a serious business, we are a supportive team that is optimizing the remote experience to create strong and fulfilling relationships even when we are physically apart. Our group of hard-working employees thrive in a positive and inclusive environment, where a bias towards action is rewarded. We have raised over $500M in venture capital from investors including Tiger Global, Andreessen Horowitz, Matrix Partners, Meritech Capital Partners, and Initialized Capital. Now surpassing a $5.5B valuation, Flock is scaling intentionally and seeking the best and brightest to help us meet our goal of reducing crime in the United States by 25% in the next three years. The Opportunity The integrations team is seeking a seasoned Senior Software Engineer, to bolster our rapid expansion to new business verticals. Our customer-facing software continues to solve crime for new customer personas, resulting in new partnerships and integrations. To keep momentum, we must integrate with various data sources that provide real-time crime and operational context on multiple FlockOS surfaces. You'll be working on integrating a variety of real-time law enforcement systems, specifically  computer-assisted-dispatch (CAD). You will also provide feedback to our developer hub with a growing list of APIs for developers. A key part of this role will be to partner and communicate daily with customers, 3rd party vendors, and all stakeholders to ensure custom integrations are scoped, built, delivered, and supported successfully. The Skillset Love writing code and have extensive experience doing so Excellent written and verbal communication skills in customer-facing communications Able to organize, keep track, and deliver multiples projects in parallel Motivated by taking an unknown problem, sinking your teeth in, and coming up with a plan of attack. Proficiency in writing, optimizing, and troubleshooting complex SQL queries for data extraction, transformation, and integration. Proficiency with relational database systems (especially PostgreSQL and Microsoft SQL Server) and a solid understanding of database design principles Experience in integrating and syncing data between disparate systems, including resolving data format inconsistencies Understanding of on-premise networks, including firewalls, VPNs, and network configurations, to ensure seamless system communication and data transfer. Experience with Go and Typescript (Node) web services Experience with microservice-oriented architecture and designing systems at scale – We process over 1 billion images daily in real-time. Strong backend/database and pub/sub experience, we leverage Postgres DB, OpenSearch, DynamoDB, Redis (use the right tool for the job) Experience with AWS and cloud tooling such as Kubernetes (EKS), AWS Lambda, Docker Ability to work cross-functionally with internal and external engineering and product teams The ideal candidate will have experience with CAD systems and databases Feeling uneasy that you haven’t ticked every box? That’s okay; we’ve felt that way too. Studies have shown women and minorities are less likely to apply unless they meet all qualifications. We encourage you to break the status quo and apply to roles that would make you excited to come to work every day. 90 Days at Flock We are a results-oriented culture and believe job descriptions are a thing of the past. We prescribe 90 day plans and believe that good days, lead to good weeks, which lead to good months. This serves as a preview of the 90 day plan you will receive if you were to be hired as a Senior Software Engineer at Flock Safety. The First 30 Days Meet with your teammates and stakeholders! Understand current processes and procedures Work on minor tasks for the sprint with support Work towards understanding how integrations at Flock work Collaborate with additional teams to gain context on how integrations fit into the overall system Asking questions in a public way to spread knowledge The First 60 Days Ability to perform the role with decreased need for guidance Ability to complete medium-sized tasks with little support Possess a high-level understanding of the features we are working on Understand the software design philosophies being used Comfortable navigating through the code base Engaged during technical conversations to increase the quality of input 90 Days & Beyond Able to explain each of the integration services’ purpose. Identify 3-5 ideas of where you see risk (stability, features, process, etc) Ability to perform role with little guidance with transparency Be comfortable picking up engineering tasks of larger size and more ambiguity Communicating across multiple teams to solve problems efficiently Contributing ideas for how we build better software Contributing valuable feedback in PR reviews Participate in software engineering demo day by presenting a topic that you worked on in the last few months The Interview Process We want our interview process to be a true reflection of our culture: transparent and collaborative. Throughout the interview process, your recruiter will guide you through the next steps and ensure you feel prepared every step of the way. Our First Chat: During this first conversation, you’ll meet with a recruiter to chat through your background, what you could bring to Flock, what you are looking for in your next role, and who we are. The Hiring Manager Interview: You will meet with your potential future boss to really dive into the role, the team, expectations, and what success means at Flock. This is your chance to really nerd out with someone in your field. The Technical Assessment: Our technical assessments seek to test the hard skills required to do the job. Engineers may find themselves in coding interviews or architecture discussions, sales roles may present mock discovery calls, and leadership roles may craft 90 day plans. Your recruiter will inform you of which assessment you will be assigned and ensure you are fully prepared for your big day. The Panel: Learn more about the team, responsibilities, and workflows. You should be prepared to speak about past projects, how you collaborate and communicate with others, and how you live our values. Depending on the team and role you are interviewing for, you may meet with several teammates as well as cross-functional partners. The Executive Review: A chance to meet an executive in your function and view Flock from a different lens. Be prepared to ask well-thought-out questions about the company, culture, and more. The Perks 💰 Salary & Equity : In this role, you’ll receive a starting salary of $170,000-$190,000 as well as stock options 🌴 Flexible PTO : We seriously mean it, plus 11 company holidays. ⚕️ Fully-paid health benefits plan for employees : including Medical, Dental, and Vision and an HSA match. 👪 Family Leave : All employees receive 12 weeks of 100% paid parental leave. Birthing parents are eligible for an additional 6-8 weeks of physical recovery time. 🍼 Fertility & Family Benefits: We have partnered with Maven , a complete digital health benefit for starting and raising a family. In 2025, Flock will provide a $ 50,000-lifetime maximum benefit related to eligible adoption, surrogacy, or fertility expenses. 💖 Caregiver Support: We have partnered with Cariloop to provide our employees with caregiver support 💸 Carta Tax Advisor: Employees receive 1:1 sessions with Equity Tax Advisors who can address individual grants, model tax scenarios, and answer general questions. 💚 ERGs: We want all employees to thrive and feel like they belong at Flock. We offer three ERGs today - Women of Flock, Flock Proud, and Melanin Motion. If you are interested in talking to a representative from one of these, please let your recruiter know. 💻WFH Stipend: $150 per month to cover the costs of working from home. 📚Productivity Stipend: $250 per year to use on Audible, Calm, Masterclass, Duolingo, Grammarly and so much more. 🏠Home Office Stipend: A one-time $750 to help you create your dream office. 🐾 Pet Insurance: We’ve partnered with Pumpkin to provide insurance for our employee’s fur babies.",
  "salary": "{\n  \"@context\": \"https://schema.org/\",\n  \"@type\": \"JobPosting\",\n  \"title\": \"Senior Software Engineer, Backend Integrations\",\n  \"url\": \"https://www.ycombinator.com/companies/flock-safety/jobs/YME3UnJ-senior-software-engineer-backend-integrations\",\n  \"description\": \"<h2><strong>Who is Flock?</strong></h2>\\n<p>Flock Safety is an all-in-one technology solution to eliminate crime and keep communities safe. Our intelligent platform combines the power of communities at scale - including cities, businesses, schools, and law enforcement agencies - to shape a safer future together. Our full-service, maintenance-free technology solution is trusted by communities across the country to help solve and deter crime in the pursuit of safer communities for everyone.</p>\\n<p>Our holistic public safety platform is comprehensive and intelligent, providing the actionable evidence needed to solve, deter and reduce crime across neighborhoods, schools, businesses and entire cities. Without compromising transparency or privacy, we are turning unbiased data into objective answers.</p>\\n<p>Flock strives to offer a career-defining experience where you can also make an impact on your community. While safety is a serious business, we are a supportive team that is optimizing the remote experience to create strong and fulfilling relationships even when we are physically apart. Our group of hard-working employees thrive in a positive and inclusive environment, where a bias towards action is rewarded. </p>\\n<p>We have raised over $500M in venture capital from investors including Tiger Global, Andreessen Horowitz, Matrix Partners, Meritech Capital Partners, and Initialized Capital. Now surpassing a $5.5B valuation, Flock is scaling intentionally and seeking the best and brightest to help us meet our goal of reducing crime in the United States by 25% in the next three years.</p>\\n<h1><strong>The Opportunity</strong></h1>\\n<p>The integrations team is seeking a seasoned Senior Software Engineer, to bolster our rapid expansion to new business verticals. Our customer-facing software continues to solve crime for new customer personas, resulting in new partnerships and integrations. To keep momentum, we must integrate with various data sources that provide real-time crime and operational context on multiple FlockOS surfaces. </p>\\n<p>You'll be working on integrating a variety of real-time law enforcement systems, specifically  computer-assisted-dispatch (CAD). You will also provide feedback to our <a href=\\\"https://docs.flocksafety.com/\\\">developer hub</a> with a growing list of APIs for developers. </p>\\n<p>A key part of this role will be to partner and communicate daily with customers, 3rd party vendors, and all stakeholders to ensure custom integrations are scoped, built, delivered, and supported successfully. </p>\\n<h1><strong>The Skillset</strong></h1>\\n<ul>\\n<li>Love writing code and have extensive experience doing so</li>\\n<li>Excellent written and verbal communication skills in customer-facing communications</li>\\n<li>Able to organize, keep track, and deliver multiples projects in parallel  </li>\\n<li>Motivated by taking an unknown problem, sinking your teeth in, and coming up with a plan of attack.</li>\\n<li>Proficiency in writing, optimizing, and troubleshooting complex SQL queries for data extraction, transformation, and integration.</li>\\n<li>Proficiency with relational database systems (especially PostgreSQL and Microsoft SQL Server) and a solid understanding of database design principles</li>\\n<li>Experience in integrating and syncing data between disparate systems, including resolving data format inconsistencies</li>\\n<li>Understanding of on-premise networks, including firewalls, VPNs, and network configurations, to ensure seamless system communication and data transfer.</li>\\n<li>Experience with Go and Typescript (Node) web services</li>\\n<li>Experience with microservice-oriented architecture and designing systems at scale – We process over 1 billion images daily in real-time.</li>\\n<li>Strong backend/database and pub/sub experience, we leverage Postgres DB, OpenSearch, DynamoDB, Redis (use the right tool for the job)</li>\\n<li>Experience with AWS and cloud tooling such as Kubernetes (EKS), AWS Lambda, Docker</li>\\n<li>Ability to work cross-functionally with internal and external engineering and product teams </li>\\n<li>The ideal candidate will have experience with CAD systems and databases</li>\\n</ul>\\n<p><em>Feeling uneasy that you haven’t ticked every box? That’s okay; we’ve felt that way too. Studies have shown women and minorities are less likely to apply unless they meet all qualifications. We encourage you to break the status quo and apply to roles that would make you excited to come to work every day.</em></p>\\n<h1><strong>90 Days at Flock</strong></h1>\\n<p>We are a results-oriented culture and believe job descriptions are a thing of the past. We prescribe 90 day plans and believe that good days, lead to good weeks, which lead to good months. This serves as a preview of the 90 day plan you will receive if you were to be hired as a Senior Software Engineer at Flock Safety. </p>\\n<p><strong>The First 30 Days</strong></p>\\n<ul>\\n<li>Meet with your teammates and stakeholders!</li>\\n<li>Understand current processes and procedures</li>\\n<li>Work on minor tasks for the sprint with support</li>\\n<li>Work towards understanding how integrations at Flock work</li>\\n<li>Collaborate with additional teams to gain context on how integrations fit into the overall system</li>\\n<li>Asking questions in a public way to spread knowledge</li>\\n</ul>\\n<p><strong>The First 60 Days</strong> </p>\\n<ul>\\n<li>Ability to perform the role with decreased need for guidance</li>\\n<li>Ability to complete medium-sized tasks with little support</li>\\n<li>Possess a high-level understanding of the features we are working on</li>\\n<li>Understand the software design philosophies being used</li>\\n<li>Comfortable navigating through the code base</li>\\n<li>Engaged during technical conversations to increase the quality of input</li>\\n</ul>\\n<p><strong>90 Days &amp; Beyond</strong> </p>\\n<ul>\\n<li>Able to explain each of the integration services’ purpose.</li>\\n<li>Identify 3-5 ideas of where you see risk (stability, features, process, etc) </li>\\n<li>Ability to perform role with little guidance with transparency</li>\\n<li>Be comfortable picking up engineering tasks of larger size and more ambiguity</li>\\n<li>Communicating across multiple teams to solve problems efficiently</li>\\n<li>Contributing ideas for how we build better software</li>\\n<li>Contributing valuable feedback in PR reviews</li>\\n<li>Participate in software engineering demo day by presenting a topic that you worked on in the last few months</li>\\n</ul>\\n<h1><strong>The Interview Process</strong></h1>\\n<p>We want our interview process to be a true reflection of our culture: transparent and collaborative. Throughout the interview process, your recruiter will guide you through the next steps and ensure you feel prepared every step of the way. </p>\\n<ol>\\n<li>Our First Chat: During this first conversation, you’ll meet with a recruiter to chat through your background, what you could bring to Flock, what you are looking for in your next role, and who we are. </li>\\n<li>The Hiring Manager Interview: You will meet with your potential future boss to really dive into the role, the team, expectations, and what success means at Flock. This is your chance to really nerd out with someone in your field. </li>\\n<li>The Technical Assessment: Our technical assessments seek to test the hard skills required to do the job. Engineers may find themselves in coding interviews or architecture discussions, sales roles may present mock discovery calls, and leadership roles may craft 90 day plans. Your recruiter will inform you of which assessment you will be assigned and ensure you are fully prepared for your big day. </li>\\n<li>The Panel: Learn more about the team, responsibilities, and workflows. You should be prepared to speak about past projects, how you collaborate and communicate with others, and how you live our values. Depending on the team and role you are interviewing for, you may meet with several teammates as well as cross-functional partners. </li>\\n<li>The Executive Review: A chance to meet an executive in your function and view Flock from a different lens. Be prepared to ask well-thought-out questions about the company, culture, and more.</li>\\n</ol>\\n<p> </p>\\n<h1><strong>The Perks</strong></h1>\\n<p>💰<strong>Salary &amp; Equity</strong>: In this role, you’ll receive a starting salary of $170,000-$190,000 as well as stock options</p>\\n<p>🌴<strong>Flexible PTO</strong>: We seriously mean it, plus 11 company holidays.</p>\\n<p>⚕️<strong>Fully-paid <a href=\\\"https://drive.google.com/file/d/1W8o-fLMVCOWL9pYFAVSMsSTaJAA9Vm_J/view\\\">health benefits</a> plan for employees</strong>: including Medical, Dental, and Vision and an HSA match. </p>\\n<p>👪<strong>Family Leave</strong>: All employees receive 12 weeks of 100% paid parental leave. Birthing parents are eligible for an additional 6-8 weeks of physical recovery time.</p>\\n<p>🍼<strong>Fertility &amp; Family Benefits:</strong> We have partnered with <a href=\\\"https://www.mavenclinic.com/\\\">Maven</a>, a complete digital health benefit for starting and raising a family. In 2025, Flock will provide a $ 50,000-lifetime maximum benefit related to eligible adoption, surrogacy, or fertility expenses.</p>\\n<p>💖<strong>Caregiver Support:</strong> We have partnered with <a href=\\\"https://www.cariloop.com/\\\">Cariloop</a> to provide our employees with caregiver support </p>\\n<p>💸<strong>Carta Tax Advisor:</strong> Employees receive 1:1 sessions with Equity Tax Advisors who can address individual grants, model tax scenarios, and answer general questions. </p>\\n<p>💚<strong>ERGs:</strong> We want all employees to thrive and feel like they belong at Flock. We offer three ERGs today - Women of Flock, Flock Proud, and Melanin Motion. If you are interested in talking to a representative from one of these, please let your recruiter know.</p>\\n<p><strong>💻WFH Stipend:</strong> $150 per month to cover the costs of working from home.</p>\\n<p><strong>📚Productivity Stipend:</strong> $250 per year to use on Audible, Calm, Masterclass, Duolingo, Grammarly and so much more.</p>\\n<p><strong>🏠Home Office Stipend:</strong> A one-time $750 to help you create your dream office.</p>\\n<p>🐾<strong>Pet Insurance:</strong> We’ve partnered with <a href=\\\"https://hello.pumpkin.care/comparesem/?utm_source=google&amp;utm_medium=cpc&amp;utm_campaign=Google_USA_Search_Brand&amp;utm_content=Google_USA_Search_Brand_General_Exact&amp;utm_campaignid=15710600630&amp;utm_adgroupid=131181652986&amp;utm_adid=571944109837&amp;utm_keyword=pumpkin%20pet%20insurance&amp;utm_matchtype=e&amp;gclid=Cj0KCQiA1sucBhDgARIsAFoytUuUlyKvQJvyvkLRt5ii432apq_7ng3BLv0vyiWHFdaawRzn-FrsMckaAvI5EALw_wcB\\\">Pumpkin</a> to provide insurance for our employee’s fur babies.</p>\\n\",\n  \"datePosted\": \"2025-01-30T22:57:43Z\",\n  \"employmentType\": \"FULL_TIME\",\n  \"hiringOrganization\": {\n    \"@type\": \"Organization\",\n    \"name\": \"Flock Safety\",\n    \"sameAs\": \"http://www.flocksafety.com\",\n    \"logo\": \"https://bookface-images.s3.amazonaws.com/small_logos/ee69b5c905088288ff0fc007921dde14514a40a1.png\"\n  },\n  \"baseSalary\": {\n    \"@type\": \"MonetaryAmount\",\n    \"currency\": \"USD\",\n    \"value\": {\n      \"@type\": \"QuantitativeValue\",\n      \"unitText\": \"YEAR\",\n      \"minValue\": 170000,\n      \"maxValue\": 250000\n    }\n  },\n  \"jobLocationType\": \"TELECOMMUTE\",\n  \"applicantLocationRequirements\": {\n    \"@type\": \"Country\",\n    \"name\": \"US\"\n  }\n}",
  "job_type": "Full-time",
  "experience_level": "Senior Software Engineer, Backend Integrations at Flock Safety | Y Combinator"
}