{
  "url": "https://www.ycombinator.com/companies/blee/jobs/LgUEvWV-ai-engineer",
  "source": "y_combinator",
  "scraped_at": "2025-10-03 22:10:01",
  "title": "AI Engineer",
  "company": "Blee",
  "location": "AI Engineering Lead at Aios Medical — Remote, $80k-$120k/year inc equity",
  "description_html": "<div class=\"prose max-w-full\"><p><strong>About the Role</strong></p>\n<p>We’re looking for an AI Engineer specializing in agent system design to architect and implement the next generation of intelligent compliance systems. You’ll design frameworks where multiple agents—powered by custom and foundational models—work together to surface, track, and explain compliance flags. You will also train models based on user feedback to better provide more targeted compliance recommendations to users.</p>\n<p><strong>Responsibilities</strong></p>\n<p>-Architect multi-agent systems that integrate with both foundational LLMs and custom-trained models.</p>\n<p>-Build mechanisms for transparent flagging, ensuring every compliance flag is traceable to prior rules, examples, or data assets.</p>\n<p>-Collaborate with compliance users to translate complex rules into agent workflows.</p>\n<p>-Ensure explainability, auditability, and traceability of model outputs.</p>\n<p>-Partner with model training engineers to incorporate feedback loops into the system design.</p>\n<p>-Design, train, and fine-tune models that improve compliance accuracy and adaptability.</p>\n<p>-Build systems that automatically transform compliance rules into agent ready logic paths</p>\n<p>-Use user feedback and outcomes data to drive iterative training and personalization.</p>\n<p><strong>Qualifications</strong></p>\n<p>-Strong knowledge of agent-based architectures and orchestration frameworks</p>\n<p>-Proficiency in Python and modern software engineering practices (APIs, microservices, distributed systems).</p>\n<p>-Hands-on experience with LLM fine-tuning</p>\n<p>-Background in data preprocessing, feature engineering, and training pipelines.</p>\n<p>-Proficiency with PyTorch, TensorFlow, or other ML frameworks.</p>\n<p>-Familiarity with compliance, governance, or rule-based systems a strong plus.</p>\n<p>-Strong communication skills and ability to work cross-functionally.</p>\n<p>-Authorized to work in the U.S. on a permanent basis without sponsorship.</p>\n<p><strong>Compensation &amp; Benefits</strong></p>\n<p>-Competitive salary and equity package</p>\n<p>-Fully paid medical, dental, and vision insurance</p>\n<p>-Free access to OneMedical</p>\n<p>-Short and long-term disability insurance</p>\n<p>-Company-paid life insurance</p>\n<p>-Company-sponsored 401k</p>\n<p>-Unlimited PTO (with mandatory 15 days off)</p>\n<p>-Financial support for work-adjacent learning opportunities</p>\n</div>",
  "description_text": "About the Role We’re looking for an AI Engineer specializing in agent system design to architect and implement the next generation of intelligent compliance systems. You’ll design frameworks where multiple agents—powered by custom and foundational models—work together to surface, track, and explain compliance flags. You will also train models based on user feedback to better provide more targeted compliance recommendations to users. Responsibilities -Architect multi-agent systems that integrate with both foundational LLMs and custom-trained models. -Build mechanisms for transparent flagging, ensuring every compliance flag is traceable to prior rules, examples, or data assets. -Collaborate with compliance users to translate complex rules into agent workflows. -Ensure explainability, auditability, and traceability of model outputs. -Partner with model training engineers to incorporate feedback loops into the system design. -Design, train, and fine-tune models that improve compliance accuracy and adaptability. -Build systems that automatically transform compliance rules into agent ready logic paths -Use user feedback and outcomes data to drive iterative training and personalization. Qualifications -Strong knowledge of agent-based architectures and orchestration frameworks -Proficiency in Python and modern software engineering practices (APIs, microservices, distributed systems). -Hands-on experience with LLM fine-tuning -Background in data preprocessing, feature engineering, and training pipelines. -Proficiency with PyTorch, TensorFlow, or other ML frameworks. -Familiarity with compliance, governance, or rule-based systems a strong plus. -Strong communication skills and ability to work cross-functionally. -Authorized to work in the U.S. on a permanent basis without sponsorship. Compensation & Benefits -Competitive salary and equity package -Fully paid medical, dental, and vision insurance -Free access to OneMedical -Short and long-term disability insurance -Company-paid life insurance -Company-sponsored 401k -Unlimited PTO (with mandatory 15 days off) -Financial support for work-adjacent learning opportunities",
  "salary": "$140K - $170K",
  "job_type": "Full-time",
  "experience_level": "Senior Software Engineer, AI"
}